In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

# Concatenate

In [2]:
arr1 = np.arange(9).reshape(3,3)

In [3]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [4]:
arr2 = np.arange(9).reshape(3,3)

In [5]:
arr2

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [7]:
np.concatenate([arr1,arr2])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [8]:
np.concatenate([arr1,arr2],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [9]:
s1 = Series([1,2,3], index=['X','Y','Z'])

In [10]:
s2 = Series([4,5], index=['A','B'])

In [11]:
s1

X    1
Y    2
Z    3
dtype: int64

In [12]:
s2

A    4
B    5
dtype: int64

In [13]:
pd.concat([s1,s2])

X    1
Y    2
Z    3
A    4
B    5
dtype: int64

In [14]:
pd.concat([s1,s2],axis=1) #列连接生成 dataFrame

     0    1
X  1.0  NaN
Y  2.0  NaN
Z  3.0  NaN
A  NaN  4.0
B  NaN  5.0

In [15]:
df1 = DataFrame(np.random.randn(4,3), columns=['X','Y','Z'])

In [16]:
df1

          X         Y         Z
0  1.543930 -1.042786 -0.563770
1 -1.713368 -0.429793 -0.806948
2 -0.723297  0.920809  0.915821
3 -0.068958 -0.583898  0.075180

In [17]:
df2 = DataFrame(np.random.randn(3,3), columns=['X','Y','A'])

In [18]:
df2

          X         Y         A
0  1.051267  0.751404  0.478760
1 -1.756899  1.670384 -0.734561
2 -0.168052  0.004249  0.510609

In [19]:
pd.concat([df1,df2])

          X         Y         Z         A
0  1.543930 -1.042786 -0.563770       NaN
1 -1.713368 -0.429793 -0.806948       NaN
2 -0.723297  0.920809  0.915821       NaN
3 -0.068958 -0.583898  0.075180       NaN
0  1.051267  0.751404       NaN  0.478760
1 -1.756899  1.670384       NaN -0.734561
2 -0.168052  0.004249       NaN  0.510609

In [ ]:
#For more info in documentation:
url='http://pandas.pydata.org/pandas-docs/stable/generated/pandas.concat.html'

# Combine

In [20]:
s1 = Series([2, np.nan, 4, np.nan], index=['A','B','C','D'])

In [21]:
s1

A    2.0
B    NaN
C    4.0
D    NaN
dtype: float64

In [22]:
s2 = Series([1,2,3,4], index=['A','B','C','D'])

In [23]:
s2

A    1
B    2
C    3
D    4
dtype: int64

In [25]:
s1.combine_first(s2)  # s2 填充s1 没有的

A    2.0
B    2.0
C    4.0
D    4.0
dtype: float64

In [26]:
df1 = DataFrame({
    'X': [1, np.nan, 3, np.nan],
    'Y': [5, np.nan, 7, np.nan],
    'Z': [9, np.nan, 11,np.nan]
})

In [27]:
df1

     X    Y     Z
0  1.0  5.0   9.0
1  NaN  NaN   NaN
2  3.0  7.0  11.0
3  NaN  NaN   NaN

In [28]:
df2 = DataFrame({
    'Z':[np.nan, 10, np.nan, 12],
    'A':[1,2,3,4]
})

In [30]:
df2

      Z  A
0   NaN  1
1  10.0  2
2   NaN  3
3  12.0  4

In [31]:
df1.combine_first(df2)

   A    X    Y     Z
0  1  1.0  5.0   9.0
1  2  NaN  NaN  10.0
2  3  3.0  7.0  11.0
3  4  NaN  NaN  12.0